from lab1 import Employees
from itertools import permutations
import math


matrices = {
    "mat1": [[10, 19, 8, 15],
               [13, 11, 17, 10],
               [12, 14, 16, 18],
               [19, 8, 11, 14]]
    ,
    "mat2": [[5, 12, 18, 20, 23, 14],
               [10, 9, 6, 12, 15, 11],
               [14, 17, 12, 8, 11, 16],
               [21, 15, 13, 16, 9, 12],
               [12, 10, 14, 18, 22, 7],
               [8, 13, 16, 11, 15, 10]]
    ,
    "mat3": [[17, 3, 14, 8, 1, 19, 5, 12],
             [11, 20, 2, 15, 7, 18, 13, 5],
             [8, 16, 4, 11, 1, 14, 19, 2],
             [7, 13, 6, 17, 38, 12, 15, 9],
             [20, 4, 10, 51, 14, 6, 18, 3],
             [11, 16, 71, 2, 13, 5, 8, 12],
             [4, 20, 17, 7, 10, 15, 1, 14],
             [6, 12, 4, 64, 53, 3, 34, 43]]
}

POPULATION_SIZE = 50
MUTATION_PROBABILITY = 0.7  # Высокая, так как кроссовера нет
TOURNAMENT_SIZE = 2
MAX_ITERATIONS = 1000
PLATEAU_LIMIT = 3

# константы для миграций
ISLANDS_NUMBER = 10 # количество популяций
TOP_PERCENT = 20 # процент лучших, который отбираем
TO_ADD = math.ceil(POPULATION_SIZE * 0.2)

""" 
Алгоритм описан в эксель-таблице. Дополнение к написанному - те 20% лучших из каждой популяции добавляются в общий пул лучших особей, 
а потом в каждую из популяций добавляем некоторое количество особей из этого пула случайным образом.
"""